# language: ru
Функционал: Доклад про парное программирование
    Контекст:
        Пусть пользователь находится на странице, посвященной парному программированию

    Сценарий: Иллюстрация процесса
        Тогда появляется картина с иллюстрацией процесса парного программирования

    Сценарий: Плюсы и минусы
        Когда пользователь нажимает клавишу со стрелкой "Вправо"
        Тогда картина с иллюстрацией процесса парного программирования остается
        И появляется описание плюсов и минусов

    Сценарий: Предложения
        Пусть пользователь нажал клавишу со стрелкой "Вправо"
        Когда он нажмёт клавишу со стрелкой "Вправо" еще раз
        Тогда картина с иллюстрацией процесса парного программирования остается
        И описание плюсов и минусов остается
        И появляется список предложений для решения проблемы разделения знания

